tutorials/compressibleLesInterFoam/depthCharge2D/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phase1 //water
{
    transportModel  Newtonian;
    nu              nu [0 2 -1 0 0 0 0] 1e-6;
    rho             rho [1 -3 0 0 0 0 0] 1000;
    rho0            rho0 [1 -3 0 0 0 0 0] 1000;
    psi             psi [0 -2 2 0 0] 1e-5;
}

phase2 //air
{
    transportModel  Newtonian;
    nu              nu [0 2 -1 0 0 0 0] 1.589e-5;
    rho             rho [1 -3 0 0 0 0 0] 1;
    rho0            rho0 [1 -3 0 0 0 0 0] 0;
    psi             psi [0 -2 2 0 0] 1e-5;
}

pMin           pMin [1 -1 -2 0 0 0 0] 1e4;

sigma           sigma [1 0 -2 0 0 0 0] 0.07;

// ************************************************************************* //
